Revit 2027 API
IFCAggregateIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IFCData Current { get; }
Public Overridable ReadOnly Property Current As IFCData
	Get
public:
virtual property IFCData^ Current {
	IFCData^ get ();
}
abstract Current : IFCData with get
override Current : IFCData with get
Property Value
IFCData
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace